// Студент Иннополиса: Перемещение из общежития в университет

void main() {
  while (true) {
    if(нужно на занятие) {
      if(важная пара){
        используй переход и иди на пары();
      } else {
        собрать вещи();
        позавтракать();
        умыться;
        можно пойти через улицу и прогуляться();
      }

      пойти в университет();
    } else {
      continue;
    }

  }
}

void занимайся самостоятельно по курсам() {
  for(из 5 курсов) {
    if(хочется программировать) {
      выбрать курс();
      завершить урок();
      break;
    } else {
      continue;
    }
  }
}

void язык программирования() {
  for(задание) {
    if(написать приложение) {
      flutter create new project();
      break;
    } else {
      continue;
    }
  }
}